const TableHead = ({ pageType, pageTypeProp }) => {
  const headerMap = {
    subStore: [
      "درخواست نمبر",
      "نوع",
      "درخواست کنندہ",
      "درخواست کی تاریخ",
      "منظوری کی تاریخ",
      "تکمیل کی تاریخ",
      "حالت",
      "عملیات",
    ],
    returnRequestList: [
      "واپسی نمبر",
      "بھیجے جانے والا اسٹور",
      "بھیجنے والا",
      "آئٹمز",
      "تاریخ",
      "اسٹیٹس",
      "عمل",
    ],
    subStoreManager: [
      "درخواست نمبر",
      "نوع",
      "درخواست کنندہ",
      "درخواست کی تاریخ",
      "منظوری کی تاریخ",
      "تکمیل کی تاریخ",
      "حالت",
      "عملیات",
    ],
    mainSubStoreReqs: [
      "درخواست نمبر",
      "اسٹور سے",
      " مرکزی اسٹور کو",
      "درخواست کنندہ",
      "منظور کنندہ",
      "مکمل کرنے والا",
      "درخواست کی تاریخ",
      "تکمیل کی تاریخ",
      "حالت",
      "عملیات",
    ],
    mainAllItems: [
      "آئٹم نمبر",
      "نام",
      "زمرہ",
      "اکائی",
      "آئٹم کی قسم",
      "مرکزی اسٹور کا اسٹاک",
      "ذیلی اسٹورز کو بھیجا گیا",
      "ذیلی اسٹورز کو بھیجی جارہی",
      "مین اسٹور کو بھیجی جارہی",
      "باقی اسٹاک",
      "کم از کم اسٹاک",
      "اسٹاک میں واپس کر دیا گیا",
      "اسکریپ",
      "حالت",
      ...(pageTypeProp === "AddItemsAndCategories" ? ["عمل"] : [])
    ],
    returnModal: [
      "آئٹم نمبر",
      "نام",
      "قسم",
      "اکائی",
      "دستیاب مقدار",
      "واپس بھیجی جانے والی مقدار",
      "واپسی مقدار",
    ],
    mainStoreProcessReturns: [
      "واپسی نمبر",
      "بھیجنے والا اسٹور",
      "بھیجنے والا",
      "آئٹمز",
      "تاریخ",
      "اسٹیٹس",
      "عمل",
    ],
    mainReqToHO: [
      "درخواست نمبر",
      "درخواست کنندہ",
      "درخواست کی تاریخ",
      "منظوری کی تاریخ",
      "تکمیل کی تاریخ",
      "حالت",
      "عمل",
    ],
    mainStoreApprover: [
      "درخواست نمبر",
      "درخواست کنندہ",
      "درخواست کی تاریخ",
      "منظوری کی تاریخ",
      "تکمیل کی تاریخ",
      "حالت",
      "عملیات",
    ],
    headOffice: [
      "درخواست نمبر",
      "درخواست کنندہ",
      "مکمل کرنے والا",
      "درخواست کی تاریخ",
      "منظوری کی تاریخ",
      "تکمیل کی تاریخ",
      "حالت",
      "عملیات",
    ],
    pettyCash: [
      "درخواست نمبر",
      "درخواست کنندہ",
      "مکمل کرنے والا",
      "درخواست کی تاریخ",
      "منظوری کی تاریخ",
      "تکمیل کی تاریخ",
      "حالت",
      "عملیات",
    ]
  }
  const headers = headerMap[pageType] || []
  return (
    <>
      <tr className="bg-gray-50 border-b border-gray-200">
        {headers.map((h) => (
          <th
            key={h}
            className="px-4 py-3 text-gray-500 font-semibold text-xs uppercase tracking-wider"
          >
            {h}
          </th>
        ))}
      </tr>
    </>
  )
}

export default TableHead