const TableHead = ({ pageType }) => {
  const headerMap = {
    subStore: [
      "درخواست نمبر",
      "نوع",
      "درخواست کنندہ",
      "درخواست کی تاریخ",
      "منظوری کی تاریخ",
      "تکمیل کی تاریخ",
      "حالت",
      "عملیات",
    ],
    subStoreManager: [
      "درخواست نمبر",
      "نوع",
      "درخواست کنندہ",
      "درخواست کی تاریخ",
      "منظوری کی تاریخ",
      "تکمیل کی تاریخ",
      "حالت",
      "عملیات",
    ],
    mainSubStoreReqs: [
      "درخواست نمبر",
      "اسٹور سے",
      " مرکزی اسٹور کو",
      "درخواست کنندہ",
      "منظور کنندہ",
      "مکمل کرنے والا",
      "درخواست کی تاریخ",
      "تکمیل کی تاریخ",
      "حالت",
      "عملیات",
    ],
    mainAllItems: [
      "آئٹم نمبر",
      "نام",
      "زمرہ",
      "اکائی",
      "آئٹم کی قسم",
      "مرکزی اسٹور کا اسٹاک",
      "ذیلی اسٹورز کو بھیجا گیا",
      "بھیجی جا رہی",
      "مین اسٹور ٹرانزٹ",
      "باقی اسٹاک",
      "کم از کم اسٹاک",
      "واپس آئٹمز",
      "اسکریپ",
      "حالت",
    ],
    mainStoreProcessReturns: [
      "واپسی نمبر",
      "بھیجنے والا اسٹور",
      "بھیجنے والا",
      "آئٹمز",
      "تاریخ",
      "اسٹیٹس",
      "عمل",
    ],
    mainReqToHO: [
      "درخواست نمبر",
      "درخواست کنندہ",
      "درخواست کا وقت",
      "منظوری کا وقت",
      "مکمل ہونے کا وقت",
      "حالت",
      "عمل",
    ],
    mainStoreApprover: [
      "درخواست نمبر",
      "درخواست کنندہ",
      "درخواست کا وقت",
      "منظوری کا وقت",
      "مکمل ہونے کا وقت",
      "حالت",
      "عملیات",
    ],
    headOffice: [
      "درخواست نمبر",
      "درخواست کنندہ",
      "درخواست کا وقت",
      "منظوری کا وقت",
      "مکمل ہونے کا وقت",
      "حالت",
      "عملیات",
    ],
    pettyCash: [
      "درخواست نمبر",
      "درخواست کنندہ",
      "درخواست کا وقت",
      "منظوری کا وقت",
      "مکمل ہونے کا وقت",
      "حالت",
      "عملیات",
    ]
  }
  const headers = headerMap[pageType] || []
  return (
    <>
      <tr className="bg-gray-50 border-b border-gray-200">
        {headers.map((h) => (
          <th
            key={h}
            className="px-4 py-3 text-gray-500 font-semibold text-xs uppercase tracking-wider"
          >
            {h}
          </th>
        ))}
      </tr>
    </>
  )
}

export default TableHead